{
    "investors": {
        "description": "Extracts a list of all investors, including subscribers (Teckningsåtagare) and guarantors (Garantiåtagande), using a detailed, multi-level extraction logic.",
        "source_types": ["Prospectus", "Memorandum", "InformationDocument", "Terms", "Publication", "New commitments"],
        "semantic_search_query": "Section or table listing investor names, subscription commitments (teckningsåtaganden or teckningsförbindelser), and guarantee commitments (garantiåtaganden or garanti)",
        "page_selection_strategy": "consecutive"
    },
    "important_dates": {
        "description": "Extracts all important dates for the rights issue (record date, subscription period, rights trading period, etc.) in a single pass.",
        "source_types": ["Prospectus", "Memorandum", "InformationDocument", "Terms", "Publication", "Outcome"],
        "semantic_search_query": "Tidsplan eller tidplan med viktiga datum för företrädesemissionen (avstämningsdag, teckningsperiod, handel med teckningsrätter)",
        "page_selection_strategy": "consecutive"
    },
    "offering_terms": {
        "description": "Extracts the financial terms of the offering: ratios (shares_required, rights_received, etc.), subscription price (unit_sub_price), and total volume (offered_units).",
        "source_types": ["Prospectus", "Memorandum", "InformationDocument", "Terms", "Publication", "Outcome"],
        "semantic_search_query": "Villkor för företrädesemissionen (teckningskurs, teckningsrelation, erbjuden volym, units eller aktier)",
        "page_selection_strategy": "consecutive"
    },
    "offering_outcome": {
        "description": "Extracts the outcome of the offering: total units subscribed, subscription with/without rights, and guarantor subscription (both in absolute numbers and percentages).",
        "source_types": ["Outcome", "Publication"],
        "semantic_search_query": "Slutgiltigt utfall i företrädesemissionen (tecknat med stöd av rätter, utan stöd av rätter, garanter, total teckning)",
        "page_selection_strategy": "consecutive"
    },
    "identifiers": {
        "description": "Extracts various identifiers related to the rights issue, such as ISIN codes for units and subscription rights.",
        "source_types": ["Prospectus", "Memorandum", "InformationDocument", "Terms", "Publication"],
        "semantic_search_query": "ISIN-kod för units, teckningsrätter, BTU, eller aktier",
        "page_selection_strategy": "top_hit"
    }
}
